STMicroelectronics-CentralLabs/ST_Drone_FCU_F401/STM32 FW Project/BLE Remocon Beta release 301117/Src/main_backup.c
/* USER CODE END 0 */

 int main(void)
{

  /* USER CODE BEGIN 1 */
  int16_t pid_interval, i;
  
  int mytimcnt = 0;
  acc_fil.AXIS_X = 0;
  acc_fil.AXIS_Y = 0;
  acc_fil.AXIS_Z = 0;
  mag_fil.AXIS_X = 0;
  mag_fil.AXIS_Y = 0;
  mag_fil.AXIS_Z = 0;
  gyro_fil.AXIS_X = 0;
  gyro_fil.AXIS_Y = 0;
  gyro_fil.AXIS_Z = 0;
  euler_rc_fil.thx = 0;
  euler_rc_fil.thy = 0;
  euler_rc_fil.thz = 0;
  acc_off_calc.AXIS_X = 0;
  acc_off_calc.AXIS_Y = 0;
  acc_off_calc.AXIS_Z = 0;
  gyro_off_calc.AXIS_X = 0;
  gyro_off_calc.AXIS_Y = 0;
  gyro_off_calc.AXIS_Z = 0;
  acc_offset.AXIS_X = 0;
  acc_offset.AXIS_Y = 0;
  acc_offset.AXIS_Z = 1000;
  gyro_offset.AXIS_X = 0;
  gyro_offset.AXIS_Y = 0;
  gyro_offset.AXIS_Z = 0;
  euler_rc.thz = euler_ahrs.thz;
  euler_ahrs_offset.thx = 0;
  euler_ahrs_offset.thy = 0;

  for(i=0;i<4;i++)
  {
    acc_y_pre[i].AXIS_X = 0;
    acc_y_pre[i].AXIS_Y = 0;
    acc_y_pre[i].AXIS_Z = 0;
    acc_x_pre[i].AXIS_X = 0;
    acc_x_pre[i].AXIS_Y = 0;
    acc_x_pre[i].AXIS_Z = 0;
    gyro_y_pre[i].AXIS_X = 0;
    gyro_y_pre[i].AXIS_Y = 0;
    gyro_y_pre[i].AXIS_Z = 0;
    gyro_x_pre[i].AXIS_X = 0;
    gyro_x_pre[i].AXIS_Y = 0;
    gyro_x_pre[i].AXIS_Z = 0;
    euler_rc_y_pre[i].thx = 0;
    euler_rc_y_pre[i].thy = 0;
    euler_rc_y_pre[i].thz = 0;
    euler_rc_x_pre[i].thx = 0;
    euler_rc_x_pre[i].thy = 0;
    euler_rc_x_pre[i].thz = 0;
  }

  /* USER CODE END 1 */

  /* MCU Configuration----------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* Configure the system clock */
  SystemClock_Config();

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_ADC1_Init();  
  MX_TIM2_Init();
  MX_TIM4_Init();
  MX_TIM9_Init();
  MX_USART1_UART_Init();
  //MX_USB_DEVICE_Init();
 
  /* USER CODE BEGIN 2 */

  PRINTF("STEVAL-FCU001V1 FW rev.1.0 - Sep 2017\n\n");
  
//  Initialize Onboard LED
  BSP_LED_Init(LED1);
  BSP_LED_Init(LED2);
  BSP_LED_Off(LED1);
  BSP_LED_Off(LED2);
  BSP_LED_On(LED1);
  BSP_LED_On(LED2);
  
  /* Configure and disable all the Chip Select pins for sensors on SPI*/
  Sensor_IO_SPI_CS_Init_All();
  
  /* Initialize and Enable the available sensors on SPI*/
  initializeAllSensors();
  enableAllSensors();
  
  /* Initialize settings for 6-axis MEMS Accelerometer */
  /* ODR 6.6kHz */
  /* FS 4g */
  /* Analog Filter Bandwith @ 1500Hz */
  /* ODR/2 low pass filtered sent to composite filter */
  /* Low pass filter enabled @ ODR/400 */
  //BSP_ACCELERO_Set_ODR_Value(LSM6DSL_X_0_handle, 1660.0);       /* ODR 1.6kHz */
  BSP_ACCELERO_Set_ODR_Value(LSM6DSL_X_0_handle, 6660.0);       /* ODR 6.6kHz */
  BSP_ACCELERO_Set_FS(LSM6DSL_X_0_handle, FS_MID);                   /* FS 4g */
  //LSM6DSL_ACC_GYRO_W_InComposit(LSM6DSL_X_0_handle, LSM6DSL_ACC_GYRO_IN_ODR_DIV_4);   /* ODR/4 low pass filtered sent to composite filter */
  LSM6DSL_ACC_GYRO_W_InComposit(LSM6DSL_X_0_handle, LSM6DSL_ACC_GYRO_IN_ODR_DIV_2);   /* ODR/2 low pass filtered sent to composite filter */
  LSM6DSL_ACC_GYRO_W_LowPassFiltSel_XL(LSM6DSL_X_0_handle, LSM6DSL_ACC_GYRO_LPF2_XL_ENABLE); /* Enable LPF2 filter in composite filter block */
  //LSM6DSL_ACC_GYRO_W_HPCF_XL(LSM6DSL_X_0_handle, LSM6DSL_ACC_GYRO_HPCF_XL_DIV4); /* Low pass filter @ ODR/50 */
  //LSM6DSL_ACC_GYRO_W_HPCF_XL(LSM6DSL_X_0_handle, LSM6DSL_ACC_GYRO_HPCF_XL_DIV100); /* Low pass filter @ ODR/100 */
  LSM6DSL_ACC_GYRO_W_HPCF_XL(LSM6DSL_X_0_handle, LSM6DSL_ACC_GYRO_HPCF_XL_DIV400); /* Low pass filter @ ODR/400 */
  uint8_t tmp_6axis_reg_value;
  BSP_ACCELERO_Read_Reg(LSM6DSL_X_0_handle, 0x10, &tmp_6axis_reg_value);
  //tmp_6axis_reg_value = tmp_6axis_reg_value | 0x01;                             /* Set LSB to 1 >> Analog filter 400Hz*/
  tmp_6axis_reg_value = tmp_6axis_reg_value & 0xFE;                             /* Set LSB to 0 >> Analog filter 1500Hz*/
  BSP_ACCELERO_Write_Reg(LSM6DSL_X_0_handle, 0x10, tmp_6axis_reg_value);
  
  /* Initialize settings for 6-axis MEMS Gyroscope */
  /* FS 2000dps */
  /* ODR 416Hz */
  /* LPF1 FTYPE set to 10b */
  LSM6DSL_ACC_GYRO_W_LP_BW_G(LSM6DSL_G_0_handle, LSM6DSL_ACC_GYRO_LP_G_NARROW); /* LPF1 FTYPE set to 10b */                                                      
  BSP_GYRO_Write_Reg(LSM6DSL_G_0_handle, 0x11, 0x6C);                           /* Gyroscope settings: full scale 2000dps, ODR 416Hz */
  
  /* Initialize settings for Magnetometer settings (By default after reset is in in idle mode) */
  /* Register CFG_REG_A 0x60 = 0x8c */
  /* Register 0x61 = 0x02 */
  BSP_MAGNETO_Write_Reg(LIS2MDL_M_0_handle, 0x60, 0x8c);
  BSP_MAGNETO_Write_Reg(LIS2MDL_M_0_handle, 0x61, 0x02);
  
  /* Initialize Remote control*/
  init_remote_control();

  /* Initialize TIM2 for External Remocon RF receiver PWM Input*/
  HAL_TIM_IC_Start_IT(&htim2,TIM_CHANNEL_1);
  HAL_TIM_IC_Start_IT(&htim2,TIM_CHANNEL_2);
  HAL_TIM_IC_Start_IT(&htim2,TIM_CHANNEL_3);
  HAL_TIM_IC_Start_IT(&htim2,TIM_CHANNEL_4);

  /* Initialize TIM4 for Motors PWM Output*/
  HAL_TIM_PWM_Start(&htim4,TIM_CHANNEL_1);
  HAL_TIM_PWM_Start(&htim4,TIM_CHANNEL_2);
  HAL_TIM_PWM_Start(&htim4,TIM_CHANNEL_3);
  HAL_TIM_PWM_Start(&htim4,TIM_CHANNEL_4);

  /* Initialize General purpose TIM9 50Hz*/
  HAL_TIM_Base_Start_IT(&htim9);

  /* Initialize PID and set Motor PWM to zero */
  PIDControlInit(&pid);
  set_motor_pwm_zero(&motor_pwm);

  /* Setup a timer with 5ms interval */
  pid_interval = PID_SAMPLING_TIME*1000;
  SetupTimer(&tim, pid_interval);

  /* Start timer */
  StartTimer(&tim);
  ch = 0;
  ch_flag = 0;
  
  
  
  /* BLE communication */
  PRINTF("BLE communication initialization...\n\n");
  BlueNRG_Init();
  /* Initialize the BlueNRG Custom services */
  Init_BlueNRG_Custom_Services();
  
  /* BLE loop for debugging - BEGIN */
  while (1){
    
    /* handle BLE event */
    if(HCI_ProcessEvent) {
      HCI_ProcessEvent=0;
      HCI_Process();
    }
    //HCI_Process();
  
    /* BLE Debug*/
    if(set_connectable){
      /* Now update the BLE advertize data and make the Board connectable */
      setConnectable();
      set_connectable = FALSE;
    }
    
