STMicroelectronics-CentralLabs/ST_Drone_FCU_F401/STM32 FW Project/BLE Remocon Beta release 301117/Src/main_backup.c
   // HAL_Delay(100);
    /* Send MEMS Motion Data to BLE */
    //if(SendAccGyroMag) {
      //SendAccGyroMag=0;
      SendMotionData();
      HAL_Delay(100);
    //}
  }
  /* BLE loop for debugging - END */
  
  /* USER CODE END 2 */

  
  
  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1)
  {
    /* USER CODE END WHILE */

    /* USER CODE BEGIN 3 */

    if (tim9_event_flag == 1)
    {     // Timer9 event: frequency 50Hz
      tim9_event_flag = 0;

      count1++;
           
      acc_ahrs.AXIS_X = 0;
      acc_ahrs.AXIS_Y = 0;
      acc_ahrs.AXIS_Z = 0;
      gyro_ahrs.AXIS_X = 0;
      gyro_ahrs.AXIS_Y = 0;
      gyro_ahrs.AXIS_Z = 0;

      for(i=0;i<FIFO_Order;i++)
      {
        acc_ahrs.AXIS_X += acc_ahrs_FIFO[i].AXIS_X;
        acc_ahrs.AXIS_Y += acc_ahrs_FIFO[i].AXIS_Y;
        acc_ahrs.AXIS_Z += acc_ahrs_FIFO[i].AXIS_Z;
        gyro_ahrs.AXIS_X += gyro_ahrs_FIFO[i].AXIS_X;
        gyro_ahrs.AXIS_Y += gyro_ahrs_FIFO[i].AXIS_Y;
        gyro_ahrs.AXIS_Z += gyro_ahrs_FIFO[i].AXIS_Z;
      }

      acc_ahrs.AXIS_X *=FIFO_Order_Recip;
      acc_ahrs.AXIS_Y *=FIFO_Order_Recip;
      acc_ahrs.AXIS_Z *=FIFO_Order_Recip;
      gyro_ahrs.AXIS_X *=FIFO_Order_Recip;
      gyro_ahrs.AXIS_Y *=FIFO_Order_Recip;
      gyro_ahrs.AXIS_Z *=FIFO_Order_Recip;

      acc_fil_int.AXIS_X = acc_ahrs.AXIS_X;
      acc_fil_int.AXIS_Y = acc_ahrs.AXIS_Y;
      acc_fil_int.AXIS_Z = acc_ahrs.AXIS_Z;
      gyro_fil_int.AXIS_X = gyro_ahrs.AXIS_X;
      gyro_fil_int.AXIS_Y = gyro_ahrs.AXIS_Y;
      gyro_fil_int.AXIS_Z = gyro_ahrs.AXIS_Z;


      //PRINTF("%f %f %f %f\n", acc_ahrs.AXIS_X, acc_ahrs.AXIS_Y, gyro_ahrs.AXIS_X, gyro_ahrs.AXIS_Y);

      // AHRS update, quaternion & true gyro data are stored in ahrs
      ahrs_fusion_ag(&acc_ahrs, &gyro_ahrs, &ahrs);

      // Calculate euler angle drone
      QuaternionToEuler(&ahrs.q, &euler_ahrs);

      // Get target euler angle from remote control
      GetTargetEulerAngle(&euler_rc, &euler_ahrs);


      if(gTHR<MIN_THR)
      {
        euler_ahrs_offset.thx = 0;
        euler_ahrs_offset.thy = 0;
      }

      Fly_origin.X_Degree = (int16_t)(euler_ahrs.thx * 5730);
      Fly_origin.Y_Degree = (int16_t)(euler_ahrs.thy * 5730);
      Fly_origin.Z_Degree = (int16_t)(euler_ahrs.thz * 5730);


      if(gTHR<MIN_THR)
      {
        euler_rc.thz = 0;
        euler_ahrs.thz = 0;
      }

      euler_rc_fil.thx = euler_rc.thx;
      euler_rc_fil.thy = euler_rc.thy;
      euler_rc_fil.thz = euler_rc.thz;

      FlightControlPID_OuterLoop(&euler_rc_fil, &euler_ahrs, &ahrs, &pid);

    }

  if (HAL_GPIO_ReadPin(GPIOA, GPIO_PIN_1) == GPIO_PIN_SET)
  {
    ch_flag = 1;
  }

  if (isTimerEventExist(&tim))    // Check if a timer event is present
  {

        ClearTimer(&tim);           // Clear current event;

        count2++;

        mytimcnt++;
        if (rc_connection_flag && rc_enable_motor)
        {
          if (mytimcnt%50 == 0)
          BSP_LED_On(LED2);
        }
        else
        {
          if (mytimcnt%50 == 0)
            BSP_LED_Toggle(LED2);
        }
    }
  
    /* Added for debug on UART*/
    /* Remocon ELE, AIL, RUD, THR, Motor1_pwm, AHRS Euler angle x and y axis */
    PRINTF("%d\t%d\t%d\t%d\t%f\t%f\t%f\t%f\t%f\n", gELE, gAIL, gRUD, gTHR, motor_pwm.motor1_pwm, euler_ahrs.thx * 57.3, euler_ahrs.thy * 57.3, euler_rc.thx * 57.3, euler_rc.thy * 57.3);
    /* Remocon THR, Acc and Gyro FIFO data x and y axis, AHRS Euler angle x and y axis, Remocon Euler angle x and y axis*/
    //PRINTF("%d\t%f\t%f\t%f\t%f\t%f\t%f\t%f\t%f\n", gTHR, acc_ahrs.AXIS_X, acc_ahrs.AXIS_Y, gyro_ahrs.AXIS_X, gyro_ahrs.AXIS_Y, euler_ahrs.thx * 57.3, euler_ahrs.thy * 57.3, euler_rc.thx * 57.3, euler_rc.thy * 57.3);
    /* MEMS Accelerometer RAW data */
    //PRINTF("%d\t%d\t%d\t\n", acc.AXIS_X, acc.AXIS_Y, acc.AXIS_Z);
      
//    /* Pressure data on UART for debug*/
//    PRINTF("Pressure [atm] = %f\n\n",pre);  
//    /* Magnetometer data on UART for debug*/
//    PRINTF("Magnetometer X = %d\tY = %d\tZ = %d\n\n", mag.AXIS_X, mag.AXIS_Y, mag.AXIS_Z);  
//    
//    /* Update 05/12/16 - Added reading of Battery voltage and data on UART */
//    //VBAT_Sense = HAL_ADC_GetValue(&hadc1);
//    HAL_ADC_Start(&hadc1);
//        if (HAL_ADC_PollForConversion(&hadc1, 1000000) == HAL_OK)
//        {
//            VBAT_Sense = HAL_ADC_GetValue(&hadc1);
//            VBAT = (((VBAT_Sense*3.3)/4095)*(BAT_RUP+BAT_RDW))/BAT_RDW;
//            PRINTF("Battery voltage = %fV\n\n", VBAT);
//        }
//    HAL_ADC_Stop(&hadc1);

  }
  /* USER CODE END 3 */

}

/** System Clock Configuration
*/
void SystemClock_Config(void)
{
  RCC_OscInitTypeDef RCC_OscInitStruct;
  RCC_ClkInitTypeDef RCC_ClkInitStruct;

    /**Configure the main internal regulator output voltage 
    */
  __HAL_RCC_PWR_CLK_ENABLE();

  __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE2);

    /**Initializes the CPU, AHB and APB busses clocks 
    */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
  RCC_OscInitStruct.HSEState = RCC_HSE_ON;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
  RCC_OscInitStruct.PLL.PLLM = 16;
  RCC_OscInitStruct.PLL.PLLN = 336;
  RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV4;
  RCC_OscInitStruct.PLL.PLLQ = 7;

  HAL_RCC_OscConfig(&RCC_OscInitStruct);
  
    /**Initializes the CPU, AHB and APB busses clocks 
    */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV2;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;
  HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_2);

    /**Configure the Systick interrupt time 
    */
  HAL_SYSTICK_Config(HAL_RCC_GetHCLKFreq()/1000);

    /**Configure the Systick 
    */
  HAL_SYSTICK_CLKSourceConfig(SYSTICK_CLKSOURCE_HCLK);

  /* SysTick_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(SysTick_IRQn, 0, 0);

  
