STMicroelectronics-CentralLabs/ST_Drone_FCU_F401/STM32 FW Project/BLE Remocon Beta release 301117/Src/main_backup.c
  /*Configure GPIO pins : PB4 PB5 */
  GPIO_InitStruct.Pin = GPIO_PIN_4|GPIO_PIN_5;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_OD;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_LOW;
  HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

}

/* USER CODE BEGIN 4 */
/*
 *  Handle Timer9 interrupt @ 800Hz
 *  Set the event flag and increase time index
 */
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
//  if(sensor_init_cali == 0)
//  {
//    sensor_init_cali_count++;
//
//    if(sensor_init_cali_count > 800)
//    {
//      // Read sensor data and prepare for specific coodinate system
//      ReadSensorRawData(LSM6DSL_X_0_handle, LSM6DSL_G_0_handle, LIS2MDL_M_0_handle, LPS22HB_P_0_handle, &acc, &gyro, &mag, &pre);
//
//      acc_off_calc.AXIS_X += acc.AXIS_X;
//      acc_off_calc.AXIS_Y += acc.AXIS_Y;
//      acc_off_calc.AXIS_Z += acc.AXIS_Z;
//
//      gyro_off_calc.AXIS_X += gyro.AXIS_X;
//      gyro_off_calc.AXIS_Y += gyro.AXIS_Y;
//      gyro_off_calc.AXIS_Z += gyro.AXIS_Z;
//
//      if (sensor_init_cali_count >= 1600)
//      {
//        acc_offset.AXIS_X = acc_off_calc.AXIS_X * 0.00125;
//        acc_offset.AXIS_Y = acc_off_calc.AXIS_Y * 0.00125;
//        acc_offset.AXIS_Z = acc_off_calc.AXIS_Z * 0.00125;
//
//        gyro_offset.AXIS_X = gyro_off_calc.AXIS_X * 0.00125;
//        gyro_offset.AXIS_Y = gyro_off_calc.AXIS_Y * 0.00125;
//        gyro_offset.AXIS_Z = gyro_off_calc.AXIS_Z * 0.00125;
//
//        acc_off_calc.AXIS_X = 0;
//        acc_off_calc.AXIS_Y = 0;
//        acc_off_calc.AXIS_Z = 0;
//        gyro_off_calc.AXIS_X = 0;
//        gyro_off_calc.AXIS_Y = 0;
//        gyro_off_calc.AXIS_Z = 0;
//
//        sensor_init_cali_count = 0;
//        sensor_init_cali = 1;
//      }
//    }
//  }
//
//  if(sensor_init_cali == 1)
//  {
//    tim9_cnt++;
//    tim9_cnt2++;
//
//    // Read sensor data and prepare for specific coodinate system
//    ReadSensorRawData(LSM6DSL_X_0_handle, LSM6DSL_G_0_handle, LIS2MDL_M_0_handle, LPS22HB_P_0_handle, &acc, &gyro, &mag, &pre);
//
//    if (rc_cal_flag == 1)
//    {
//      acc_off_calc.AXIS_X += acc.AXIS_X;
//      acc_off_calc.AXIS_Y += acc.AXIS_Y;
//      acc_off_calc.AXIS_Z += acc.AXIS_Z;
//
//      gyro_off_calc.AXIS_X += gyro.AXIS_X;
//      gyro_off_calc.AXIS_Y += gyro.AXIS_Y;
//      gyro_off_calc.AXIS_Z += gyro.AXIS_Z;
//
//      rc_cal_cnt++;
//
//      if (rc_cal_cnt >= 800)
//      {
//        acc_offset.AXIS_X = acc_off_calc.AXIS_X * 0.00125;
//        acc_offset.AXIS_Y = acc_off_calc.AXIS_Y * 0.00125;
//        acc_offset.AXIS_Z = acc_off_calc.AXIS_Z * 0.00125;
//
//        gyro_offset.AXIS_X = gyro_off_calc.AXIS_X * 0.00125;
//        gyro_offset.AXIS_Y = gyro_off_calc.AXIS_Y * 0.00125;
//        gyro_offset.AXIS_Z = gyro_off_calc.AXIS_Z * 0.00125;
//
//        acc_off_calc.AXIS_X = 0;
//        acc_off_calc.AXIS_Y = 0;
//        acc_off_calc.AXIS_Z = 0;
//        gyro_off_calc.AXIS_X = 0;
//        gyro_off_calc.AXIS_Y = 0;
//        gyro_off_calc.AXIS_Z = 0;
//
//        rc_cal_cnt = 0;
//        rc_cal_flag = 0;
//      }
//    }
//
//    acc.AXIS_X -= acc_offset.AXIS_X;
//    acc.AXIS_Y -= acc_offset.AXIS_Y;
//    acc.AXIS_Z -= (acc_offset.AXIS_Z - 1000);
//    gyro.AXIS_X -= gyro_offset.AXIS_X;
//    gyro.AXIS_Y -= gyro_offset.AXIS_Y;
//    gyro.AXIS_Z -= gyro_offset.AXIS_Z;
//
//    // Save filtered data to acc_FIFO
//    acc_FIFO[tim9_cnt2-1].AXIS_X = acc.AXIS_X;
//    acc_FIFO[tim9_cnt2-1].AXIS_Y = acc.AXIS_Y;
//    acc_FIFO[tim9_cnt2-1].AXIS_Z = acc.AXIS_Z;
//
//    // IIR Filtering on gyro
//    gyro_fil.AXIS_X = gyro_fil_coeff.b0*gyro.AXIS_X + gyro_fil_coeff.b1*gyro_x_pre[0].AXIS_X + gyro_fil_coeff.b2*gyro_x_pre[1].AXIS_X
//                                                    + gyro_fil_coeff.a1*gyro_y_pre[0].AXIS_X + gyro_fil_coeff.a2*gyro_y_pre[1].AXIS_X;
//    gyro_fil.AXIS_Y = gyro_fil_coeff.b0*gyro.AXIS_Y + gyro_fil_coeff.b1*gyro_x_pre[0].AXIS_Y + gyro_fil_coeff.b2*gyro_x_pre[1].AXIS_Y
//                                                    + gyro_fil_coeff.a1*gyro_y_pre[0].AXIS_Y + gyro_fil_coeff.a2*gyro_y_pre[1].AXIS_Y;
//    gyro_fil.AXIS_Z = gyro_fil_coeff.b0*gyro.AXIS_Z + gyro_fil_coeff.b1*gyro_x_pre[0].AXIS_Z + gyro_fil_coeff.b2*gyro_x_pre[1].AXIS_Z
//                                                    + gyro_fil_coeff.a1*gyro_y_pre[0].AXIS_Z + gyro_fil_coeff.a2*gyro_y_pre[1].AXIS_Z;
//    // Shift IIR filter state
//    for(int i=1;i>0;i--)
//    {
//      gyro_x_pre[i].AXIS_X = gyro_x_pre[i-1].AXIS_X;
//      gyro_x_pre[i].AXIS_Y = gyro_x_pre[i-1].AXIS_Y;
//      gyro_x_pre[i].AXIS_Z = gyro_x_pre[i-1].AXIS_Z;
//      gyro_y_pre[i].AXIS_X = gyro_y_pre[i-1].AXIS_X;
//      gyro_y_pre[i].AXIS_Y = gyro_y_pre[i-1].AXIS_Y;
//      gyro_y_pre[i].AXIS_Z = gyro_y_pre[i-1].AXIS_Z;
//    }
//    gyro_x_pre[0].AXIS_X = gyro.AXIS_X;
//    gyro_x_pre[0].AXIS_Y = gyro.AXIS_Y;
//    gyro_x_pre[0].AXIS_Z = gyro.AXIS_Z;
//    gyro_y_pre[0].AXIS_X = gyro_fil.AXIS_X;
//    gyro_y_pre[0].AXIS_Y = gyro_fil.AXIS_Y;
//    gyro_y_pre[0].AXIS_Z = gyro_fil.AXIS_Z;
//
//    //  Save filtered data to gyro_FIFO
//    gyro_FIFO[tim9_cnt2-1].AXIS_X = gyro_fil.AXIS_X;
//    gyro_FIFO[tim9_cnt2-1].AXIS_Y = gyro_fil.AXIS_Y;
//    gyro_FIFO[tim9_cnt2-1].AXIS_Z = gyro_fil.AXIS_Z;
//    
//
//    if(tim9_cnt2 == FIFO_Order)
//    {
//      tim9_cnt2 = 0;
//      tim9_event_flag = 1;
//      for(int i=0;i<FIFO_Order;i++)
//      {
//        acc_ahrs_FIFO[i].AXIS_X = acc_FIFO[i].AXIS_X;
//        acc_ahrs_FIFO[i].AXIS_Y = acc_FIFO[i].AXIS_Y;
//        acc_ahrs_FIFO[i].AXIS_Z = acc_FIFO[i].AXIS_Z;
//        gyro_ahrs_FIFO[i].AXIS_X = gyro_FIFO[i].AXIS_X;
//        gyro_ahrs_FIFO[i].AXIS_Y = gyro_FIFO[i].AXIS_Y;
//        gyro_ahrs_FIFO[i].AXIS_Z = gyro_FIFO[i].AXIS_Z;
//      }
//    }
//
//      
//      gyro_rad.gx = gyro_fil.AXIS_X*COE_MDPS_TO_RADPS;
//      gyro_rad.gy = gyro_fil.AXIS_Y*COE_MDPS_TO_RADPS;
//      gyro_rad.gz = gyro_fil.AXIS_Z*COE_MDPS_TO_RADPS;
//
//      euler_ahrs.thz += gyro_rad.gz*PID_SAMPLING_TIME;
//
//      if(gTHR<MIN_THR)
//      {
//        euler_rc.thz = 0;
//        euler_ahrs.thz = 0;
//      }
//
//
//      if (rc_connection_flag && rc_enable_motor)
//      {   // Do PID Control
//        FlightControlPID_innerLoop(&euler_rc_fil, &gyro_rad, &ahrs, &pid, &motor_pwm);
//      }
//      else
//      {
//        // set motor output zero
//        set_motor_pwm_zero(&motor_pwm);
//      }
//
//      if(gTHR<MIN_THR)
//      {
//        set_motor_pwm_zero(&motor_pwm);
//      }
//
//      set_motor_pwm(&motor_pwm);      /* To comment if want to debug remocon calibration switching off the motors */
//  }
}


/**
* @brief  Initialize all sensors
* @param  None
* @retval None
*/
static void initializeAllSensors( void )
{
  if (BSP_ACCELERO_Init( LSM6DSL_X_0, &LSM6DSL_X_0_handle ) != COMPONENT_OK)
  {
    while(1);
  }
  
  if (BSP_GYRO_Init( LSM6DSL_G_0, &LSM6DSL_G_0_handle ) != COMPONENT_OK)
  {
    while(1);
  }
  
