STMicroelectronics-CentralLabs/ST_Drone_FCU_F401/STM32 FW Project/BLE Remocon Beta release 301117/Src/main_backup.c
  if (BSP_MAGNETO_Init( LIS2MDL_M_0, &LIS2MDL_M_0_handle ) != COMPONENT_OK)
  {
    while(1);
  }
  
  
  if (BSP_PRESSURE_Init( LPS22HB_P_0, &LPS22HB_P_0_handle ) != COMPONENT_OK)
  {
    while(1);
  }

//  if (BSP_TEMPERATURE_Init( LPS22HB_T_0, &LPS22HB_T_0_handle ) != COMPONENT_OK)
//  {
//    while(1);
//  }
//  
  
}

/**
* @brief  Enable all sensors
* @param  None
* @retval None
*/
void enableAllSensors( void )
{
  BSP_ACCELERO_Sensor_Enable( LSM6DSL_X_0_handle );
  PRINTF("LSM6DSL MEMS Accelerometer initialized and enabled\n");
  BSP_GYRO_Sensor_Enable( LSM6DSL_G_0_handle );
  PRINTF("LSM6DSL MEMS Gyroscope initialized and enabled\n");
  BSP_MAGNETO_Sensor_Enable( LIS2MDL_M_0_handle );
  PRINTF("LIS2MDL Magnetometer initialized and enabled\n");
  BSP_PRESSURE_Sensor_Enable( LPS22HB_P_0_handle );
  PRINTF("LPS22HB Pressure sensor initialized and enabled\n");
//  BSP_TEMPERATURE_Sensor_Enable( LPS22HB_T_0_handle );
}



void BlueNRG_Init(void)
{
  
  int ret = 1;
  uint8_t  hwVersion=0;
  uint16_t fwVersion=0;
  
  PRINTF("****** START BLE TESTS ******\r\n");
  BNRG_SPI_Init();

  uint8_t tmp_bdaddr[6]= {MAC_BLUEMS};
  int32_t i;
  for(i=0;i<6;i++)
    bdaddr[i] = tmp_bdaddr[i];
  
  /* Initialize the BlueNRG HCI */
  HCI_Init();
    
 /* Reset BlueNRG hardware */
  BlueNRG_RST();
  
  /* get the BlueNRG HW and FW versions */
  PRINTF("\r\nReading BlueNRG version ...\r\n");
  if (getBlueNRGVersion(&hwVersion, &fwVersion)== BLE_STATUS_SUCCESS)
  {
    
    /* 
     * Reset BlueNRG again otherwise it will fail.
     */
    BlueNRG_RST();
    
    PRINTF("Setting Pubblic Address...\r\n");
    ret = aci_hal_write_config_data(CONFIG_DATA_PUBADDR_OFFSET,
                                    CONFIG_DATA_PUBADDR_LEN,
                                    bdaddr);
    if(ret){
      testStatus = COMPONENT_ERROR;
      PRINTF("\r\nSetting Pubblic BD_ADDR failed *****\r\n");
      goto fail;
    }
    
    PRINTF("GATT Initializzation...\r\n");
    ret = aci_gatt_init();    
    if(ret){
      testStatus = COMPONENT_ERROR;
      PRINTF("\r\nGATT_Init failed ****\r\n");
      goto fail;
    }

//    ret = aci_gatt_update_char_value(service_handle, dev_name_char_handle, 0,
//                                     7/*strlen(BoardName)*/, (uint8_t *)BoardName);
//  
//    if(ret){
//       PRINTF("\r\naci_gatt_update_char_value failed\r\n");
//      while(1);
//    }
    
    /* Set the GAP INIT like IDB05A1 since using same SPBTLE_RF module*/
    ret = aci_gap_init_IDB05A1(GAP_PERIPHERAL_ROLE_IDB05A1, 0, 0x07, &service_handle, &dev_name_char_handle, &appearance_char_handle);
  
    if(ret != BLE_STATUS_SUCCESS){
      PRINTF("\r\nGAP_Init failed\r\n");
      goto fail;
    }
    
    PRINTF("GAP setting Authentication ....\r\n");
    ret = aci_gap_set_auth_requirement(MITM_PROTECTION_REQUIRED,
                                       OOB_AUTH_DATA_ABSENT,
                                       NULL, 7, 16,
                                       USE_FIXED_PIN_FOR_PAIRING, 123456,
                                       BONDING);
    if (ret != BLE_STATUS_SUCCESS) {
      testStatus = COMPONENT_ERROR;
       PRINTF("\r\nGAP setting Authentication failed ******\r\n");
       goto fail;
    }

    PRINTF("SERVER: BLE Stack Initialized \r\n"
           "Board HWver=%d, FWver=%d.%d.%c\r\n"
           "BoardMAC = %x:%x:%x:%x:%x:%x\r\n",
           hwVersion,
           fwVersion>>8,
           (fwVersion>>4)&0xF,
           (hwVersion > 0x30) ? ('a'+(fwVersion&0xF)-1) : 'a',
           bdaddr[5],bdaddr[4],bdaddr[3],bdaddr[2],bdaddr[1],bdaddr[0]);

    /* Set output power level */
    aci_hal_set_tx_power_level(1,4);
    
    ret = Add_ConsoleW2ST_Service();
    if(ret == BLE_STATUS_SUCCESS)
       PRINTF("Console Service W2ST added successfully\r\n");
    else{
       testStatus = COMPONENT_ERROR;
       PRINTF("\r\nError while adding Console Service W2ST\r\n");
    }
    
    ret = Add_ConfigW2ST_Service();
    if(ret == BLE_STATUS_SUCCESS)
       PRINTF("Config  Service W2ST added successfully\r\n");
    else{
       testStatus = COMPONENT_ERROR;
       PRINTF("\r\nError while adding Config Service W2ST\r\n");
    }
    
    PRINTF("\r\nAll test passed!\r\n");
  }
  else {
       testStatus = COMPONENT_ERROR;
       PRINTF("\r\nError in BlueNRG tests. ******\r\n");
  }
  PRINTF("****** END BLE TESTS ******\r\n");
  return;

fail:
  testStatus = COMPONENT_ERROR;
  return;
}

/**
 * @brief  Add the Console service using a vendor specific profile
 * @param  None
 * @retval tBleStatus Status
 */
//tBleStatus Add_ConsoleW2ST_Service(void)
//{
//  tBleStatus ret;
//
//  uint8_t uuid[16];
//
//  COPY_CONSOLE_SERVICE_UUID(uuid);
//  ret = aci_gatt_add_serv(UUID_TYPE_128,  uuid, PRIMARY_SERVICE, 1+3*2,&ConsoleW2STHandle);
//
//  if (ret != BLE_STATUS_SUCCESS) {
//    goto fail;
//  }
//
//  COPY_TERM_CHAR_UUID(uuid);
//  ret =  aci_gatt_add_char(ConsoleW2STHandle, UUID_TYPE_128, uuid, W2ST_CONSOLE_MAX_CHAR_LEN,
//                           CHAR_PROP_NOTIFY| CHAR_PROP_WRITE_WITHOUT_RESP | CHAR_PROP_WRITE | CHAR_PROP_READ ,
//                           ATTR_PERMISSION_NONE,
//                           GATT_NOTIFY_ATTRIBUTE_WRITE | GATT_NOTIFY_READ_REQ_AND_WAIT_FOR_APPL_RESP,
//                           16, 1, &TermCharHandle);
//
//  if (ret != BLE_STATUS_SUCCESS) {
//    goto fail;
//  }
//
//  COPY_STDERR_CHAR_UUID(uuid);
//  ret =  aci_gatt_add_char(ConsoleW2STHandle, UUID_TYPE_128, uuid, W2ST_CONSOLE_MAX_CHAR_LEN,
//                           CHAR_PROP_NOTIFY | CHAR_PROP_READ,
//                           ATTR_PERMISSION_NONE,
//                           GATT_NOTIFY_READ_REQ_AND_WAIT_FOR_APPL_RESP,
//                           16, 1, &StdErrCharHandle);
//
//  if (ret != BLE_STATUS_SUCCESS) {
//     goto fail;
//  }
//
//  return BLE_STATUS_SUCCESS;
//
//fail:
//  PRINTF("Error while adding Console service.\n");
//  return BLE_STATUS_ERROR;
//}

/**
 * @brief  Add the Config service using a vendor specific profile
 * @param  None
 * @retval tBleStatus Status
 */
//tBleStatus Add_ConfigW2ST_Service(void)
//{
//  tBleStatus ret;
//
//  uint8_t uuid[16];
//
//  COPY_CONFIG_SERVICE_UUID(uuid);
//  ret = aci_gatt_add_serv(UUID_TYPE_128,  uuid, PRIMARY_SERVICE, 1+3,&ConfigServW2STHandle);
//
//  if (ret != BLE_STATUS_SUCCESS)
//    goto fail;
//
//  COPY_CONFIG_W2ST_CHAR_UUID(uuid);
//  ret =  aci_gatt_add_char(ConfigServW2STHandle, UUID_TYPE_128, uuid, 20 /* Max Dimension */,
//                           CHAR_PROP_NOTIFY| CHAR_PROP_WRITE_WITHOUT_RESP,
//                           ATTR_PERMISSION_NONE,
//                           GATT_NOTIFY_ATTRIBUTE_WRITE | GATT_NOTIFY_READ_REQ_AND_WAIT_FOR_APPL_RESP,
//                           16, 1, &ConfigCharHandle);
//
//  if (ret != BLE_STATUS_SUCCESS) {
//    goto fail;
//  }
//
//  return BLE_STATUS_SUCCESS;
//
//fail:
//  PRINTF("Error while adding Configuration service.\n");
//  return BLE_STATUS_ERROR;
//}

/** @brief Initialize all the Custom BlueNRG services
 * @param None
 * @retval None
 */
static void Init_BlueNRG_Custom_Services(void)
{
  int ret;
  
  ret = Add_HWServW2ST_Service();
  if(ret == BLE_STATUS_SUCCESS) {
     PRINTF("HW      Service W2ST added successfully\r\n");
  } else {
     PRINTF("\r\nError while adding HW Service W2ST\r\n");
  }

  ret = Add_ConsoleW2ST_Service();
  if(ret == BLE_STATUS_SUCCESS) {
     PRINTF("Console Service W2ST added successfully\r\n");
  } else {
     PRINTF("\r\nError while adding Console Service W2ST\r\n");
  }

